Documents/ПокупкаРыб.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПокупкаРыб</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиРыб</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Рыбы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аквариум</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Аквариум</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПородаРыб</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПородаРыб</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПокупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПокупкаРыб/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура РыбыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Рыбы.ТекущиеДанные;  
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.ЦенаПокупки;
КонецПроцедуры

&НаКлиенте
Процедура РыбыЦенаПокупкиПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Рыбы.ТекущиеДанные;  
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.ЦенаПокупки;
КонецПроцедуры
